# @Author   :xaidc
# @Time     :2018/9/7 20:34
# @File     :homework5.py
'''
5.写一个类，其功能是：1.解析指定的歌词文件的内容
2.按时间显示歌词 提示：歌词文件的内容一般是按下面的格式进行存储的。
歌词前面对应的是时间，在对应的时间点可以显示对应的歌词

[00:00.20]蓝莲花
[00:00.80]没有什么能够阻挡
[00:06.53]你对自由地向往
[00:11.59]天马行空的生涯
[00:16.53]你的心了无牵挂
[02:11.27][01:50.22][00:21.95]穿过幽暗地岁月
[02:16.51][01:55.46][00:26.83]也曾感到彷徨
[02:21.81][02:00.60][00:32.30]当你低头地瞬间
[02:26.79][02:05.72][00:37.16]才发觉脚下的路
[02:32.17][00:42.69]心中那自由地世界
[02:37.20][00:47.58]如此的清澈高远
[02:42.32][00:52.72]盛开着永不凋零
[02:47.83][00:57.47]蓝莲花
'''

str = """
[00:00.20]蓝莲花
[00:00.80]没有什么能够阻挡
[00:06.53]你对自由地向往
[00:11.59]天马行空的生涯
[00:16.53]你的心了无牵挂
[02:11.27][01:50.22][00:21.95]穿过幽暗地岁月
[02:16.51][01:55.46][00:26.83]也曾感到彷徨
[02:21.81][02:00.60][00:32.30]当你低头地瞬间
[02:26.79][02:05.72][00:37.16]才发觉脚下的路
[02:32.17][00:42.69]心中那自由地世界
[02:37.20][00:47.58]如此的清澈高远
[02:42.32][00:52.72]盛开着永不凋零
[02:47.83][00:57.47]蓝莲花
"""


class Music:
    dict = {}
    def __init__(self,lyric):
        self.lyric = lyric
    def scarlet(self):
        for i in self.lyric.splitlines():  #提取每一行
            a = i.replace("[","]").split("]")
            for j in range(len(a) - 1):
                Music.dict[a[j]] = a[-1]
        for key in sorted(set(Music.dict.keys())):
            print(key,Music.dict[key])
        return '解析完毕'
p1 = Music(str)
x = p1.scarlet()
print(x)