//js中的运算符包含:数学运算符,比较运算符,逻辑运算符,赋值运算符,三目运算符,(位运算)
//1.数学运算符:+,-,*,/,%,**(js7中才有),++,--
//其中:+,-,*,/,%,**(js7中才有)和python中的功能一模一样
//注意:js中没有整除的运算符

//a.++(自加):自加1
//语法:变量++,++变量---->让变量的值加1

var num = 10
num++
num++
console.log(num)

//b.--(自减1操作)
//语法:变量--,--变量 ---->让变量的值减一

//c.赋值的时候,++/--写在变量的后面,是先赋值,然后再让变量的值加1/减1,++/--写变量的前面,就先加1/减1,然后再赋值
var a=10,a2=10,b,c
b=a++
c=++a
console.log(b,c)


//2.比较运算符:>,<,==,!=,===,!==,>=,<=,<==,>==
//结果都是布尔值
//==:只判断值是否相等
//===:判断值和类型是否相等

console.log(5==5)
console.log('5'=='5')
console.log('5'==5)

console.log(5===5)
console.log('5'==='5')
console.log('5'===5)//false

//3.逻辑运算符:&&(与),||(或),!(非)
//js逻辑运算符除了形式其他和python一样

//4.赋值运算符:=,+=,-=,*=,/=,%=等,和python一样

//三目运算符:?:
//语法:表达式1?值1:值2  ---判断表达式1的值是否为真,为真整个运算符的结果就是值1,否则是值2

var value = 10>2?10:2
console.log(value)

//练习:求三个数的最大值,使用三目运算符
var a=10,b=20,c=15

var d = (a>b?a:b) > c ? (a>b?a:b):c

console.log(d)


//运算顺序:和python基本一致(数学>比较>逻辑>赋值),也可以通过加括号来改变运算顺序
